Repository: pypi-data/pypi-mirror-231
Catalog: packages/noggin-aaa/noggin_aaa-1.8.0.tar.gz/noggin_aaa-1.8.0/noggin/translations/*/LC_MESSAGES/messages.po
Languages: pt_br

source: Password expired. Please reset it.
pt_br: Senha expirada. Por favor, redefina-a.

source: Could not log in to the IPA server.
pt_br: Não foi possível se autenticar no servidor IPA.

source: Welcome, %(username)s!
pt_br: Bem-vindo, %(username)s!

source: Token successfully synchronized
pt_br: Token sincronizado com sucesso

source: User %(username)s was not found in the system.
pt_br: O usuário %(username)s não foi encontrado no sistema.

source: Unable to add user %(username)s: %(errormessage)s
pt_br: Não foi possível adicionar o usuário %(username)s: %(errormessage)s

source: You got it! %(username)s has been added to %(groupname)s.
pt_br: Você conseguiu! %(username)s foi adicionado a %(groupname)s.

source: You got it! %(username)s has been removed from %(groupname)s.
pt_br: Você conseguiu! %(username)s foi removido de %(groupname)s.

source: The old password or username is not correct
pt_br: A senha antiga ou nome de usuário não está correto

source: Could not change password.
pt_br: Não foi possível alterar a senha.

source: Your password has been changed
pt_br: Sua senha foi alterada

source: You have already requested a password reset, you need to wait %(wait_min)s minute(s) and %(wait_sec)s seconds before you can request another.
pt_br: Você já solicitou uma redefinição de senha, você precisa aguardar %(wait_min)s minuto(s) e %(wait_sec)s segundos antes de solicitar outra.

source: User %(username)s does not exist
pt_br: O usuário %(username)s não existe

source: We could not send you an email, please retry later
pt_br: Não foi possível enviar um e-mail para você, tente novamente mais tarde

source: An email has been sent to your address with instructions on how to reset your password
pt_br: Um e-mail foi enviado para o seu endereço com instruções sobre como redefinir sua senha

source: The token is invalid, please request a new one.
pt_br: O token é inválido, solicite um novo.

source: The token has expired, please request a new one.
pt_br: O token expirou, solicite um novo.

source: Your password has been changed since you requested this token, please request a new one.
pt_br: Sua senha foi alterada desde que você solicitou este token, solicite um novo.

source: Your password has been changed, but it does not comply with the policy (%(policy_error)s) and has thus been set as expired. You will be asked to change it after logging in.
pt_br: Sua senha foi alterada, mas não está de acordo com a política (%(policy_error)s) e, portanto, foi definida como expirada. Você será solicitado a alterá-lo após a autenticação.

source: Incorrect value.
pt_br: Valor incorreto.

source: Could not change password, please try again.
pt_br: Não foi possível alterar a senha, tente novamente.

source: Your password has been changed.
pt_br: Sua senha foi alterada.

source: An error occurred while creating the account, please try again.
pt_br: Ocorreu um erro ao criar a conta, tente novamente.

source: Your account has been created, but the password you chose does not comply with the policy (%(policy_error)s) and has thus been set as expired. You will be asked to change it after logging in.
pt_br: Sua conta foi criada, mas a senha que você escolheu não está de acordo com a política (%(policy_error)s) e, portanto, foi definida como expirada. Você será solicitado a alterá-lo após se autenticar.

source: Your account has been created, but an error occurred while setting your password (%(message)s). You may need to change it after logging in.
pt_br: Sua conta foi criada, mas ocorreu um erro ao definir sua senha (%(message)s). Pode ser necessário alterá-lo após se autenticar.

source: Congratulations, you now have an account! Go ahead and sign in to proceed.
pt_br: Parabéns, agora você tem uma conta! Vá em frente e autentique-se para continuar.

source: Incorrect password
pt_br: Senha incorreta

source: Cannot create the token.
pt_br: Não é possível criar o token.

source: Sorry, You cannot disable your last active token.
pt_br: Desculpe, você não pode desativar seu último token ativo.

source: Cannot disable the token.
pt_br: Não é possível desativar o token.

source: Sorry, You cannot delete your last active token.
pt_br: Desculpe, você não pode excluir seu último token ativo.

source: Cannot delete the token.
pt_br: Não foi possível excluir o token.

source: New member username must not be empty
pt_br: O nome de usuário do novo membro não pode estar vazio

source: First Name
pt_br: Primeiro nome

source: First name must not be empty
pt_br: O primeiro nome não pode estar vazio

source: Last Name
pt_br: Sobrenome

source: Last name must not be empty
pt_br: O sobrenome não pode estar vazio

source: E-mail Address
pt_br: Endereço de e-mail

source: Email must not be empty
pt_br: O e-mail não pode estar vazio

source: Email must be valid
pt_br: O e-mail deve ser válido

source: Locale
pt_br: Localidade

source: Locale must not be empty
pt_br: A localidade não pode estar vazia

source: Locale must be a valid locale short-code
pt_br: A localidade deve ser um código curto válido de localidade

source: IRC Nickname
pt_br: Apelido de IRC

source: Timezone
pt_br: Fuso horário

source: Timezone must not be empty
pt_br: O fuso horário não pode estar vazio

source: Timezone must be a valid timezone
pt_br: O fuso horário deve ser um fuso horário válido

source: GitHub Username
pt_br: Nome de usuário do GitHub

source: GitLab Username
pt_br: Nome de usuário do GitLab

source: Red Hat Bugzilla Email
pt_br: E-mail do Bugzilla da Red Hat

source: SSH Keys
pt_br: Chaves SSH

source: GPG Keys
pt_br: Chaves GPG

source: Token description
pt_br: Descrição do token

source: Description must not be empty
pt_br: A descrição não pode estar vazia

source: Enter your current password
pt_br: Insira sua senha atual

source: You must provide a password
pt_br: Você deve fornecer uma senha

source: token must not be empty
pt_br: O token não pode estar vazio

source: Username
pt_br: Nome de usuário

source: You must provide a user name
pt_br: Você deve fornecer um nome de usuário

source: Password
pt_br: Senha

source: Log In
pt_br: Iniciar sessão

source: New Password
pt_br: Nova senha

source: Password must not be empty
pt_br: A senha não pode estar vazia

source: Passwords must match
pt_br: As senhas devem ser iguais

source: Confirm New Password
pt_br: Confirmar nova senha

source: OTP Token
pt_br: Token OTP

source: Enter your OTP token if you have enrolled one
pt_br: Insira seu token OTP se você tiver inscrito um

source: Current Password
pt_br: Senha atual

source: Current password must not be empty
pt_br: A senha atual não pode estar vazia

source: Just the password, don't add the OTP token if you have one
pt_br: Apenas a senha, não adicione o token OTP se você tiver um

source: User name must not be empty
pt_br: O nome de usuário não pode estar vazio

source: Enter your username to reset your password
pt_br: Insira seu nome de usuário para redefinir sua senha

source: Please choose a strong password
pt_br: Escolha uma senha forte

source: Confirm Password
pt_br: Confirmar senha

source: Register
pt_br: Registrar

source: Username must not be empty
pt_br: O nome de usuário não pode estar vazio

source: First OTP
pt_br: Primeiro OTP

source: You must provide a first code
pt_br: Você deve fornecer um primeiro código

source: Second OTP
pt_br: Segundo OTP

source: You must provide a second code
pt_br: Você deve fornecer um segundo código

source: Token ID
pt_br: ID do token

source: You've ruined everything.
pt_br: Você arruinou tudo.

source: That page wasn't found. You've gone and ruined everything.
pt_br: A página não foi encontrada. Você foi e arruinou tudo.

source: Forgot password?
pt_br: Esqueceu a senha?

source: Forgotten password or lost OTP token?
pt_br: Senha esquecida ou token OTP perdido?

source: Sync Token
pt_br: Sincronizar token

source: Password Recovery
pt_br: Recuperação de senha

source: Did you forget your password?
pt_br: Não se lembra da sua senha?

source: Enter your username and an email will be sent to your address with further instructions.
pt_br: Insira seu nome de usuário e um e-mail será enviado para seu endereço com mais instruções.

source: Send
pt_br: Enviar

source: Reset Password
pt_br: Redefinir senha

source: Password Reset for %(username)s
pt_br: Redefinição de senha para %(username)s

source: %(groupname)s Group
pt_br: Grupo %(groupname)s

source: To join this group, contact a group sponsor.
pt_br: Para ingressar neste grupo, entre em contato com um patrocinador do grupo.

source: Sponsors
pt_br: Patrocinadores

source: no sponsors
pt_br: sem patrocinadores

source: Members
pt_br: Membros

source: add user...
pt_br: adicionar usuário...

source: No members yet.
pt_br: Ainda sem membros.

source: Group List
pt_br: Lista de grupos

source: %(member_count)s members
pt_br: %(member_count)s membros

source: Login
pt_br: Iniciar sessão

source: Expired Password Reset
pt_br: Redefinição de senha expirada

source: Expired Password Reset for %(username)s
pt_br: Redefinição de senha expirada para %(username)s

source: Change Password
pt_br: Alterar senha

source: Registration
pt_br: Registro

source: Sync OTP Token
pt_br: Sincronizar token OTP

source: Synchronize OTP Token
pt_br: Sincronizar token OTP

source: Sync
pt_br: Sincronizar

source: GPG Key ID
pt_br: ID da chave GPG

source: SSH Public Key
pt_br: Chave pública SSH

source: Save
pt_br: Salvar

source: Scan your new token
pt_br: Ler seu novo token

source: Your new token is ready. Click on the button below to reveal the QR code and scan it.
pt_br: Seu novo token está pronto. Clique no botão abaixo para revelar o código QR e lê-lo.

source: Reveal
pt_br: Revelar

source: or copy and paste the following token URL if you can't scan the QR code:
pt_br: ou copie e cole a seguinte URL de token se você não consegue ler o código QR:

source: This will never be shown to you again, don't close this window until your token is saved.
pt_br: Isso nunca será mostrado a você novamente, não feche esta janela até que seu token seja salvo.

source: OTP Tokens
pt_br: Token OTP

source: Add OTP Token
pt_br: Adicionar token OTP

source: Password or Password + One-Time-Password
pt_br: Senha ou Senha + Senha de uso único (OTP)

source: Generate
pt_br: Gerar

source: Disable
pt_br: Desativar

source: Disabled
pt_br: Desativado

source: You have no OTP tokens
pt_br: Você tem nenhum token OTP

source: Settings for %(username)s
pt_br: Configurações para %(username)s

source: Profile
pt_br: Perfil

source: SSH &amp; GPG Keys
pt_br: Chaves SSH &amp; GPG

source: Profile for %(username)s
pt_br: Perfil para %(username)s

source: Groups
pt_br: Grupos

source: RHBZ E-Mail
pt_br: E-Mail RHBZ

source: Settings
pt_br: Configurações

source: sponsor
pt_br: patrocionador

source: member
pt_br: membro

source: To reset your password, click on the link below:
pt_br: Para redefinir sua senha, clique no link abaixo:

source: If you did not request your password to be reset, you can ignore this email.
pt_br: Se você não solicitou a redefinição de sua senha, pode ignorar este e-mail.

source: The Noggin team
pt_br: A equipe do Noggin

source: search...
pt_br: procurar...

source: Log Out
pt_br: Encerrar sessão

source: Powered by %(noggin_link)s
pt_br: Desenvolvido com %(noggin_link)s

source: Welcome to noggin!
pt_br: Bem-vindo ao noggin!

source: This is the open source, community self-service portal for FreeIPA. It allows you to do things like create an account, change your password, manage group membership, and more.
pt_br: Este é o portal de código aberto de autoatendimento da comunidade para FreeIPA. Ele permite que você crie uma conta, altere sua senha, gerencie a associação ao grupo e muito mais.

source: Fedora Accounts
pt_br: Contas Fedora

source: Fedora Accounts allows you to create and manage an account for Fedora Tools and Infrastructure.
pt_br: As Contas Fedora permitem que você crie e gerencie uma conta para as Ferramentas e Infraestrutura do Fedora.

source: file a Fedora Infra ticket to change the details or sponsors of this group
pt_br: preencha um tíquete no Fedora Infra para alterar os detalhes ou patrocinadores deste grupo

source: Request Change of Details
pt_br: Solicitar alteração de detalhes

source: Create a PDR request to disable your account
pt_br: Criar uma solicitação de PDR para desativar sua conta

source: Request account deletion
pt_br: Solicitar exclusão de conta

source: Did you lose your OTP token?
pt_br: Você perdeu seu token OTP?

source: If you have lost your OTP token you need to send an email to %(admin_email)s. Please sign this email using the GPG key associated with your account if possible, so that the administrator can verify your identity.
pt_br: Se você perdeu seu token OTP, você precisa enviar um e-mail para %(admin_email)s. Assine este e-mail usando a chave GPG associada à sua conta, se possível, para que o administrador possa verificar sua identidade.

source: Group %(groupname)s could not be found.
pt_br: O grupo %(groupname)s não foi encontrado.
