Repository: pypi-data/pypi-mirror-231
Catalog: packages/Trac/Trac-1.6.tar.gz/Trac-1.6/trac/locale/*/LC_MESSAGES/tracini.po
Languages: fr

source: Location of authz policy configuration file. Non-absolute paths are relative to the Environment `conf` directory.
fr: Emplacement du fichier de configuration de stratégie authz. Les chemins non absolus sont relatifs au répertoire Environnement `conf`.

source: This section provides a way to add arbitrary permissions to a Trac environment. This can be useful for adding new permissions to use for workflow actions, for example. To add new permissions, create a new section `[extra-permissions]` in your `trac.ini`. Every entry in that section defines a meta-permission and a comma-separated list of permissions. For example: {{{#!ini [extra-permissions] EXTRA_ADMIN = EXTRA_VIEW, EXTRA_MODIFY, EXTRA_DELETE }}} This entry will define three new permissions `EXTRA_VIEW`, `EXTRA_MODIFY` and `EXTRA_DELETE`, as well as a meta-permissions `EXTRA_ADMIN` that grants all three permissions. The permissions are created in upper-case characters regardless of the casing of the definitions in `trac.ini`. For example, the definition `extra_view` would create the permission `EXTRA_VIEW`. If you don't want a meta-permission, start the meta-name with an underscore (`_`): {{{#!ini [extra-permissions] _perms = EXTRA_VIEW, EXTRA_MODIFY }}}
fr: Cette section fournit un moyen d'ajouter librement des permissions sur l'environnement Trac. Cela peut être utile pour ajouter des nouvelles permissions pour les actions de flux de travail. Pour ajouter de nouvelles permissions, créer une nouvelle section `[extra-permissions]` dans le fichier `trac.ini`. Chaque entrée dans cette section définira une méta-permission et une liste séparée par des virgules de permissions. Par exemple : {{{ [extra-permissions] EXTRA_ADMIN = EXTRA_VIEW, EXTRA_MODIFY, EXTRA_DELETE }}} Cette entrée définira trois nouvelles permission `EXTRA_VIEW`, `EXTRA_MODIFY` et `EXTRA_DELETE`, et une nouvelle méta-permission `EXTRA_ADMIN` qui attribuera les trois permissions. Les permissions sont créées en majuscules, quelle que soit la définition dans le fichier `trac.ini`. Par exemple, la definition `extra_view` créera la permission `EXTRA_VIEW`. Si vous ne voulez pas de méta-permission, commencez le méta-nom par un tiret bas (`_`) : {{{ [extra-permissions] _perms = extra_view, extra_modify }}}

source: Require commands to be enclosed in an envelope. Must be empty or contain two characters. For example, if set to `[]`, then commands must be in the form of `[closes #4]`.
fr: Requiert que les commandes soient contenues dans une enveloppe. Doit être vide ou contenir deux caractères. Par exemple, si positionné à "[]", alors les commandes doivent être de la forme [closes #4].

source: Commands that close tickets, as a space-separated list.
fr: Les commandes qui clôturent les tickets, en tant que liste séparées par des espaces.

source: Commands that add a reference, as a space-separated list. If set to the special value `<ALL>`, all tickets referenced by the message will get a reference to the changeset.
fr: Les commandes qui ajoutent une référence, en tant que liste séparées par des espaces. Si positionné à une valeur spéciale <ALL>, tous les tickets référencés par le message auront une référence vers la révision.

source: Check that the committer has permission to perform the requested operations on the referenced tickets. This requires that the user names be the same for Trac and repository operations.
fr: Vérifie que le commiter a la permission d'effectuer les opérations requises sur les tickets référencés. Cela requiert que les noms d'utilisateurs soient les mêmes pour Trac et les opérations sur le dépôt.

source: Send ticket change notification when updating a ticket.
fr: Envoie une notification de changement de ticket lorsqu'un ticket est modifié.

source: Enable persistent caching of commit tree.
fr: Permettre la mise en cache persistante de l'arbre des commits.

source: Wrap `GitRepository` in `CachedRepository`.
fr: Enveloppe `GitRepository` dans CachedRepository`.

source: The length at which a sha1 is abbreviated (must be >= 4 and <= 40).
fr: La longueur à laquelle un sha1 est abrégé (doit être >= 4 et <= 40).

source: The minimum length at which a hex-string in wiki content is formatted as a changeset TracLink (must be >= 4 and <= 40).
fr: La longueur minimale d'une chaîne hexadécimale dans le wiki qui est formattée comme un lien de version (doit être >=4 et <=40).

source: Enable reverse mapping of git email addresses to trac user ids. Performance will be reduced if there are many users and the `cached_repository` option is `disabled`. A repository resync is required after changing the value of this option.
fr: Activer la correspondance entre l'adresse e-mail de Git et l'id utilisateur. Les performances seront dégradées s'il y a de nombreux utilisateurs et que l'option `cached_repository` est désactivée.

source: Use git-committer id instead of git-author id for the changeset ''Author'' field.
fr: Utilise l'id git-committer au lieu de l'id git-author pour le champs de révisions "Author".

source: Use git-committer timestamp instead of git-author timestamp for the changeset ''Timestamp'' field.
fr: Utilise l'horodatage git-committer au lieu de l'horodatage git-author pour le champs de révision "Timestamp".

source: Define charset encoding of paths within git repositories.
fr: Défini le jeu de caractères pour les chemins à l'intérieur des dépôts git.

source: Path to the git executable.
fr: Chemin vers l'exécutable git.

source: Path to a gitweb-formatted projects.list
fr: Chemin vers un projects.list au format gitweb.

source: Path to the base of your git projects
fr: Chemin vers la racine de vos projets git.

source: Template for project URLs. `%s` will be replaced with the repo name
fr: Modèle pour les URLs de projets. "%s" sera remplacé par le nom du dépôt

source: Repositories to sync on every request (not recommended).
fr: Dépôts à synchroniser à chaque requête (non recommandé).

source: Comma separated list of paths categorized as branches. If a path ends with '*', then all the directory entries found below that path will be included. Example: `/trunk, /branches/*, /projectAlpha/trunk, /sandbox/*`
fr: Liste séparée par des virgules de chemins classés en tant que branches. Si un chemin se termine par '*', alors toutes les entrées de répertoires situées sous ce chemin seront incluses. Exemple :

source: Comma separated list of paths categorized as tags. If a path ends with '*', then all the directory entries found below that path will be included. Example: `/tags/*, /projectAlpha/tags/A-1.0, /projectAlpha/tags/A-v1.1`
fr: Liste séparée par des virgules de chemins classés en tant qu'étiquettes. Si un chemin se termine par '*', alors toutes les entrées de répertoires situées sous ce chemin seront incluses. Exemple : `/tags/*, /projectAlpha/tags/A-1.0, /projectAlpha/tags/A-v1.1`

source: End-of-Line character sequences when `svn:eol-style` property is `native`. If `native`, substitute with the native EOL marker on the server. Otherwise, if `LF`, `CRLF` or `CR`, substitute with the specified EOL marker. (''since 1.0.2'')
fr: Séquence de caractères de fin de ligne (EOL) lorsque la propriété `svn:eol-style` est `native`. Si `native`, remplace par la fin de ligne native du serveur . Sinon, remplace par la fin de ligne spécifiée : `LF`, `CRLF` or `CR`

source: Maximum allowed file size (in bytes) for attachments.
fr: Taille maximum du fichier (en octets) pour les pièces jointes.

source: Maximum allowed total size (in bytes) for an attachment list to be downloadable as a `.zip`. Set this to -1 to disable download as `.zip`. (''since 1.0'')
fr: Taille totale maximum autorisée (en octets) pour la liste des pièces jointes à être téléchargées en tant que `.zip`. Positionner à -1 pour désactiver le téléchargement en tant que `.zip`. (''depuis 1.0'')

source: Whether attachments should be rendered in the browser, or only made downloadable. Pretty much any file may be interpreted as HTML by the browser, which allows a malicious user to attach a file containing cross-site scripting attacks. For public sites where anonymous users can create attachments it is recommended to leave this option disabled.
fr: Définit si les pièces joints doivent être affichées dans le navigateur, ou bien seulement téléchargeables. Quasiment tous les fichiers peuvent être interprétés comme du HTML par le navigateur, ce qui pourrait permettre à un utilisateur mal intentionné d'attacher un fichier contenant un attaque "cross-site scripting". Pour les sites publics où les utilisateurs anonymes peuvent créer des pièces jointes, il est recommandé de laisser cette option désactivée.

source: Enable or disable components provided by Trac and plugins. The component to enable/disable is specified by the option name. The enabled state is determined by the option value: setting the value to `enabled` or `on` will enable the component, any other value (typically `disabled` or `off`) will disable the component. The option name is either the fully qualified name of the component or the module/package prefix of the component. The former enables/disables a specific component, while the latter enables/disables any component in the specified package/module. Consider the following configuration snippet: {{{#!ini [components] trac.ticket.report.ReportModule = disabled acct_mgr.* = enabled }}} The first option tells Trac to disable the [TracReports report module]. The second option instructs Trac to enable all components in the `acct_mgr` package. The trailing wildcard is required for module/package matching. To view the list of active components, go to the ''Plugins'' section of ''About Trac'' (requires `CONFIG_VIEW` [TracPermissions permission]). See also: TracPlugins
fr: Activer ou désactiver les composants Trac ou fournis par les plugins. Le composant à activer/désactiver est spécifié par le nom de l'option. Le fait qu'il soit activé ou non est déterminé par la valeur de l'option ; mettre la valeur à `enabled` ou `on` active le composant, toute autre valeur (typiquement `disabled` ou `off`) désactive le composant. Le nom de l'option est au choix le nom qualifié complet du composant ou le préfixe module/package du composant. Le premier active/désactive un composant spécifique, alors que le deuxième active/désactive tout composant dans le package/module spécifié. Considérez l'extrait de configuration suivant : {{{ [components] trac.ticket.report.ReportModule = disabled webadmin.* = enabled }}} La première option dit à Trac de désactiver le [wiki:TracReports module de rapport]. La seconde option spécifie à Trac d'activer tous les composants du package `webadmin`. Notez que le caractère joker à la fin est nécessaire pour faire correspondre le module/package. Pour voir une liste des composants actifs, allez à la page ''Plugins'' sur ''À propos de Trac'' (nécessite les [wiki:TracPermissions permissions] `CONFIG_VIEW`). Voir aussi : TracPlugins

source: Path to the //shared plugins directory//. Plugins in that directory are loaded in addition to those in the directory of the environment `plugins`, with this one taking precedence. Non-absolute paths are relative to the Environment `conf` directory.
fr: Chemin vers le //répertoire des plugins partagés//. Les plugins dans ce répertoire sont chargés en plus de ceux présents dans le répertoire de l'environnement `plugins`, celui-ci ayant la priorité.

source: Base URL of the Trac site. This is used to produce documents outside of the web browsing context, such as URLs in notification e-mails that point to Trac resources.
fr: URL de base du site Trac. Est utilisé pour produire des documents en dehors d'un navigateur, par exemple dans un message qui pointe vers les ressources de Trac.

source: Optionally use `[trac] base_url` for redirects. In some configurations, usually involving running Trac behind a HTTP proxy, Trac can't automatically reconstruct the URL that is used to access it. You may need to use this option to force Trac to use the `base_url` setting also for redirects. This introduces the obvious limitation that this environment will only be usable when accessible from that URL, as redirects are frequently used.
fr: Utilisation optionnelle de `[trac] base_url` pour les redirections. Dans certaines configuration, impliquant traditionnellement l'exécution de Trac derrière un proxy HTTP, Trac est incapable de reconstruire l'URL qui a été utilisée pour y accéder. Vous pouvez avez besoin de cette option pour forcer Trac à aussi utiliser le paramètre `base_url` pour les redirections. Cela introduit une limitation évidente que cet environnement ne sera utilisable que s'il est accédé à partir de cette URL, puisque les redirections sont fréquemment utilisées.

source: Restrict cookies to HTTPS connections. When true, set the `secure` flag on all cookies so that they are only sent to the server on HTTPS connections. Use this if your Trac instance is only accessible through HTTPS.
fr: Restreint les cookies aux connexions HTTPS. Lorsque positionné à True, active le drapeau `secure` sur tous les cookies afin qu'ils ne soient envoyés au serveur que sur les connexions HTTPS. Utiliser ceci si votre instance Trac n'est accessible qu'à travers HTTPS.

source: Lifetime of the anonymous session, in days. Set the option to 0 to disable purging old anonymous sessions. (''since 1.0.17'')
fr: Durée d'une session anonyme exprimée en jours. Mettez l'option à 0 pour désactiver la purge des sessions anonymes. (''since 1.0.17'')

source: Name of the project.
fr: Nom du projet.

source: Short description of the project.
fr: Courte description du projet.

source: URL of the project web site. This is usually the domain in which the `base_url` resides. For example, the project URL might be !https://myproject.com, with the Trac site (`base_url`) residing at either !https://trac.myproject.com or !https://myproject.com/trac. The project URL is added to the footer of notification e-mails.
fr: URL du site du projet. Est habituellement le domaine où réside l'URL de base. Par exemple : l'URL du site du projet peut être !https://myproject.com, et le site Trac (`base_url`) peut résider soit à !https://trac.myproject.com ou !https://myproject.com/trac. L'URL du site du projet est ajouté au pied de des e-mails de notification.

source: E-Mail address of the project's administrator.
fr: Adresse courriel de l'administrateur du projet.

source: Base URL of a Trac instance where errors in this Trac should be reported. This can be an absolute or relative URL, or '.' to reference this Trac instance. An empty value will disable the reporting buttons.
fr: URL de base d'une instance de Trac où les erreurs de cette instance doivent être signalées. Peut être une URL absolue, relative ou "." pour farie référence à cette instance de Trac. Une valeur vide désactive les boutons de signalement.

source: Page footer text (right-aligned).
fr: Texte de pied de page de la page (alignement à droite).

source: URL of the icon of the project.
fr: URL de l'icône du projet.

source: Logging facility to use. Should be one of (`none`, `file`, `stderr`, `syslog`, `winlog`).
fr: Service de logging à utiliser. Devrait être un parmi (`none`, `file`, `stderr`, `syslog`, `winlog`).

source: If `log_type` is `file`, this should be a path to the log-file. Relative paths are resolved relative to the `log` directory of the environment.
fr: Si `log_type` est `file`, cela devrait être un chemin vers le fichier de log. Les chemins relatifs sont résolus relativement au répertoire de `log` de l'environnement.

source: Level of verbosity in log. Should be one of (`CRITICAL`, `ERROR`, `WARNING`, `INFO`, `DEBUG`).
fr: Niveau de verbosité des journaux. A définir parmi (`CRITICAL`, `ERROR`, `WARN`, `INFO`, `DEBUG`).

source: Custom logging format. If nothing is set, the following will be used: `Trac[$(module)s] $(levelname)s: $(message)s` In addition to regular key names supported by the [http://docs.python.org/library/logging.html Python logger library] one could use: - `$(path)s` the path for the current environment - `$(basename)s` the last path component of the current environment - `$(project)s` the project name Note the usage of `$(...)s` instead of `%(...)s` as the latter form would be interpreted by the !ConfigParser itself. Example: `($(thread)d) Trac[$(basename)s:$(module)s] $(levelname)s: $(message)s`
fr: Format de journalisation personnalisé. Si rien n'est précisé, le format suivant sera utilisé Trac[$(module)s] $(levelname)s: $(message)s En plus des noms de clé traditionnels de la bibliothèque de journalisation Python [http://docs.python.org/library/logging.html Python logger library], vous pouvez utiliser : - $(path)s le chemin de l'environnement courant - $(basename)s le chemin racine de l'environnement courant - $(project)s le nom du projet Notez l'usage de `$(...)s` au lieu de `%(...)s` car cette dernière forme aurait été interprétée par le !ConfigParser lui-même. Exemple : `($(thread)d) Trac[$(basename)s:$(module)s] $(levelname)s: $(message)s`

source: Name of the component implementing `IPermissionStore`, which is used for managing user and group permissions.
fr: Nom du composant implémentant `IPermissionStore`, utilisé pour gérer les permissions des utilisateurs et des groupes.

source: List of components implementing `IPermissionPolicy`, in the order in which they will be applied. These components manage fine-grained access control to Trac resources.
fr: Liste des composants implémentant `IPermissionPolicy`, dans l'ordre dans lequel ils doivent être appliqués. Ces composants gèrent le contrôle d'accès fin aux ressources Trac.

source: Database connection [wiki:TracEnvironment#DatabaseConnectionStrings string] for this project
fr: Connexion vers la base de donnée [wiki:TracEnvironment#DatabaseConnectionStrings Chaîne] pour ce projet

source: Database backup location
fr: Emplacement de sauvegarde de la base de données

source: Timeout value for database connection, in seconds. Use '0' to specify ''no timeout''.
fr: Valeur du délai d'expiration pour la connexion à la base de données en secondes. Utiliser '0' pour spécifier "pas d'expiration".

source: Show the SQL queries in the Trac log, at DEBUG level.
fr: Montrer les requêtes SQL dans le journal de Trac, au niveau DEBUG.

source: Location of mysqldump for MySQL database backups
fr: Emplacement de mysqldump pour les sauvegardes de la base de données MySQL

source: Location of pg_dump for Postgres database backups
fr: Emplacement de pg_dump pour les sauvegardes de la base de données Postgres

source: Paths to [https://sqlite.org/loadext.html sqlite extensions]. The paths may be absolute or relative to the Trac environment.
fr: Chemins vers [https://sqlite.org/loadext.html sqlite extensions]. Les chemins peuvent être absolus ou relatifs à l'environnement de trac.

source: Charset to be used when in doubt.
fr: Jeu de caractères à utiliser en cas de doute.

source: Displayed tab width in file preview.
fr: Largeur des tabulations dans l'aperçu de fichier.

source: Maximum file size for HTML preview.
fr: Taille maximale du fichier pour l'aperçu HTML.

source: List of additional MIME types and keyword mappings. Mappings are comma-separated, and for each MIME type, there's a colon (":") separated list of associated keywords or file extensions.
fr: Liste de concordance entre types MIME et mots clés. Les concordances sont séparées par des virgules, et pour chaque type MIME, il y a une liste de mots clés ou d'extensions de fichier associés séparés par des deux-points (":").

source: List of additional MIME types associated to filename patterns. Mappings are comma-separated, and each mapping consists of a MIME type and a Python regexp used for matching filenames, separated by a colon (":"). (''since 1.0'')
fr: Liste de concordances entre types MIME additionnels et motifs de fichier. Les concordances sont séparées par des virgules, et chaque concordance consiste en un type MIME et une expression régulière Python utilisé pour correspondre aux fichiers, séparés par des deux-points (":"). (''depuis 1.0'')

source: Comma-separated list of MIME types that should be treated as binary data.
fr: Liste séparée par des virgules de types MIME qui doivent être traités comme des données binaires.

source: Configure Pygments [%(url)s lexer] options. For example, to set the [%(url)s#lexers-for-php-and-related-languages PhpLexer] options `startinline` and `funcnamehighlighting`: {{{#!ini [pygments-lexer] php.startinline = True php.funcnamehighlighting = True }}} The lexer name is derived from the class name, with `Lexer` stripped from the end. The lexer //short names// can also be used in place of the lexer name.
fr: Configurer les options de Pygments [%(url)s lexer]. Par exemple, pour définir les options `startinline` and `funcnamehighlighting` de : [%(url)s#lexers-for-php-and-related-languages PhpLexer] {{{#!ini [pygments-lexer] php.startinline = True php.funcnamehighlighting = True }}} Le nom du "lexer" est dérivé du nom de la classe en supprimant "Lexer" de la fin. Le "lexer" //short names// peut également être utilisé à la place du nom du "lexer".

source: The default style to use for Pygments syntax highlighting.
fr: Le style par défaut à utiliser pour la coloration syntaxique Pygments.

source: List of additional MIME types known by Pygments. For each, a tuple `mimetype:mode:quality` has to be specified, where `mimetype` is the MIME type, `mode` is the corresponding Pygments mode to be used for the conversion and `quality` is the quality ratio associated to this conversion. That can also be used to override the default quality ratio used by the Pygments render.
fr: Liste des types MIME connus par Pygments. Pour chacun, un tuple `mimetype:mode:quality` doit être spécifié, où `mimetype` est le type MIME. `mode` est le mode correspondant Pygments à utiliser pour la conversion et `quality` est le ratio qualité associé à cette conversion. Cela peut aussi être utilisé pour supplanter le ratio qualité par défaut utilisé par le moteur de rendu Pygments,

source: Name of the component implementing `IEmailSender`. This component is used by the notification system to send emails. Trac currently provides `SmtpEmailSender` for connecting to an SMTP server, and `SendmailEmailSender` for running a `sendmail`-compatible executable.
fr: Nom du composant implémentant `IEmailSender`. Ce composant est utilisé par le système de notification pour envoyer des e-mails. Trac fournit actuellement `SmtpEmailSender` pour se connecter à un serveur SMTP, et `SendmailEmailSender` pour exécuter un exécutable compatible `sendmail`.

source: Enable email notification.
fr: Active la notification par courriel.

source: Sender address to use in notification emails. At least one of `smtp_from` and `smtp_replyto` must be set, otherwise Trac refuses to send notification mails.
fr: Adresse de l'expéditeur pour les e-mails de notification. Au moins un `smtp_from` et un `smtp_replyto` doit être défini, sinon Trac n'enverra pas d'e-mail de notification.

source: Sender name to use in notification emails.
fr: Nom de l'expéditeur à utiliser dans les courriels de notification.

source: Use the author of the change as the sender in notification emails (e.g. reporter of a new ticket, author of a comment). If the author hasn't set an email address, `smtp_from` and `smtp_from_name` are used instead. (''since 1.0'')
fr: Utiliser l'auteur de la modification comme expéditeur dans les e-mails de notification (par exemple : l'auteur du ticket ou du commentaire). Si l'auteur n'a pas défini d'adresse e-mail, `smtp_from` et `smtp_from_name` sont utilisés. (''depuis 1.0'')
