Repository: pypi-data/pypi-mirror-231
Catalog: packages/Trac/Trac-1.6.tar.gz/Trac-1.6/trac/locale/*/LC_MESSAGES/tracini.po
Languages: fr

source: Reply-To address to use in notification emails. At least one of `smtp_from` and `smtp_replyto` must be set, otherwise Trac refuses to send notification mails.
fr: Adresse de réponse pour les e-mails de notification. Au moins un `smtp_from` et un `smtp_replyto` doit être défini, sinon Trac n'enverra pas d'e-mail de notification.

source: Comma-separated list of email addresses to always send notifications to. Addresses can be seen by all recipients (Cc:).
fr: Adresses e-mail séparées par des virgules des destinataires de toutes les notifications. Les adresses peuvent être vues par tous les destinataires (Cc:).

source: Comma-separated list of email addresses to always send notifications to. Addresses are not public (Bcc:).
fr: Adresses e-mail séparées par des virgules des destinataires de toutes les notifications. Les adresses ne sont pas publiques (Bcc:).

source: Default host/domain to append to addresses that do not specify one. Fully qualified addresses are not modified. The default domain is appended to all username/login for which an email address cannot be found in the user settings.
fr: Valeur par défaut de l'hôte/domaine à ajouter aux adresses qui n'en définissent pas. Les adresses complètes ne sont pas modifiées. Le domaine par défaut est ajouté à tous les noms d'utilisateurs ou noms de connexion pour lesquels une adresse e-mail n'est pas définie dans les préférences utilisateur.

source: Comma-separated list of domains that should not be considered part of email addresses (for usernames with Kerberos domains).
fr: Liste séparée par des virgules des domaines qui ne doivent pas être considérés comme faisant partie des adresses de courriel (pour les noms d'utilisateur avec les domaines Kerberos).

source: Comma-separated list of domains that should be considered as valid for email addresses (such as localdomain).
fr: Liste séparée par des virgules des domaines qui doivent être considérés comme valides pour les adresses de courriel (tel que localdomain).

source: Specifies the MIME encoding scheme for emails. Supported values are: `none`, the default value which uses 7-bit encoding if the text is plain ASCII or 8-bit otherwise. `base64`, which works with any kind of content but may cause some issues with touchy anti-spam/anti-virus engine. `qp` or `quoted-printable`, which works best for european languages (more compact than base64) if 8-bit encoding cannot be used.
fr: Spécification de l'encodage MIME des e-mails. Les valeurs permises sont : "none", la valeur par défaut qui utilise un encodage 7 bits si le texte est du pur ASCII, sinon un encodage sur 8 bits. "base64", qui fonctionne avec tout type de contenu mais peut créer des anomalies avec certains système anti-spam/anti-virus. `qp` ou `quoted-printable`, qui fonctionne le mieux avec les langues européennes (plus compact que le bases64) si l'encodage 8 bits ne peut être utilisé.

source: Addresses in the To and Cc fields are visible to all recipients. If this option is disabled, recipients are put in the Bcc list.
fr: Les adresses dans les champs To et Cc sont visibles par tous les destinataires. Si cette option est désactivée, les adresses sont placées dans le champ Bcc.

source: Permit email address without a host/domain (i.e. username only). The SMTP server should accept those addresses, and either append a FQDN or use local delivery. See also `smtp_default_domain`. Do not use this option with a public SMTP server.
fr: Autoriser les adresses e-mail sans hôte/domaine (i.e. avec juste un nom d'utilisateur). Le serveur SMTP devrait accepter ces adresses, et au choix ajouter un FQDN ou effectuer une livraison locale. Voir aussi `smtp_default_domain`. N'utilisez pas cette option avec un un serveur SMTP public.

source: Text to prepend to subject line of notification emails. If the setting is not defined, then `[$project_name]` is used as the prefix. If no prefix is desired, then specifying an empty option will disable it.
fr: Texte à ajouter au début du sujet des courriels de notification. Si ce paramètre n'est pas défini, alors le préfixe [$project_name] est utilisé. Si vous ne souhaitez pas de préfixe, alors spécifiez une valeur vide.

source: Hash algorithm to create unique Message-ID header. ''(since 1.0.13)''
fr: Algorithme de hachage pour créer un ID d'entête de message unique. ''(depuis 1.0.13)''

source: The notifications subscriptions are controlled by plugins. All `INotificationSubscriber` components are in charge. These components may allow to be configured via this section in the `trac.ini` file. See TracNotification for more details. Available subscribers: [[SubscriberList]]
fr: Les souscriptions aux notifications sont contrôlées par les plugins. Tous les composants `INotificationSubscriber` sont responsables. Ces composants peuvent permettre d'être configurés dans cette section du fichier "trac.ini". Voir TracNotification pour plus de détails. Souscripteurs disponibles : [[SubscriberList]]

source: Comma separated list of email resolver components in the order they will be called. If an email address is resolved, the remaining resolvers will not be called.
fr: Liste des composants de résolution d'adresse e-mail dans l'ordre où ils seront appelés. (liste séparée par des virgules). Si une adresse est résolue, les composants suivants ne seront pas appelés.

source: Default format to distribute email notifications.
fr: Format par défaut pour la distribution des notifications e-mail.

source: SMTP server hostname to use for email notifications.
fr: Nom d'hôte du serveur SMTP à utiliser pour les notifications par courriel.

source: SMTP server port to use for email notification.
fr: Port du serveur SMTP à utiliser pour les notifications par courriel.

source: Username for authenticating with SMTP server.
fr: Nom d'utlisateur pour l'autentification avec le serveur SMTP.

source: Password for authenticating with SMTP server.
fr: Mot de passe pour l'autentification avec le serveur SMTP.

source: Use SSL/TLS to send notifications over SMTP.
fr: Utiliser SSL/TLS pour l'envoi des notifications par SMTP.

source: Path to the sendmail executable. The sendmail program must accept the `-i` and `-f` options.
fr: Chemin vers l'exécutable sendmail. Le programme sendmail doit accepter les options `-i` et `-f`.

source: Minimum length of query string allowed when performing a search.
fr: Longueur minimum de chaîne autorisée pour la requête, lors de l'exécution d'une recherche.

source: Specifies which search filters should be disabled by default on the search page. This will also restrict the filters for the quick search function. The filter names defined by default components are: `wiki`, `ticket`, `milestone` and `changeset`. For plugins, look for their implementation of the ISearchSource interface, in the `get_search_filters()` method, the first member of returned tuple. Once disabled, search filters can still be manually enabled by the user on the search page.
fr: Spécifie quels filtres de recherche doivent être désactivés par défaut sur la page de recherche. Cela restreindra aussi les filtres pour la fonction de recherche rapide. Les noms de filtres par défaut correspondant aux composants sont : `wiki`, `ticket`, `milestone` et `changeset`. Pour les plugins, voir dans leur implémentation de l'interface ISearchSource, dans la méthode `get_search_filters()`, le premier membre du tuple retourné. Une fois désactivé, les filtres de recherche peuvent encore être manuellement activés par l'utilisateur sur la page de recherche.

source: In this section, you can define additional fields for tickets. See TracTicketsCustomFields for more details.
fr: Dans cette section, vous pouvez définir des champs additionnels pour les tickets. Voir TracTicketsCustomFields pour plus de détails.

source: Ordered list of workflow controllers to use for ticket actions.
fr: Liste ordonnée de contrôleurs de flux de travail à utiliser pour les actions sur les tickets.

source: Make the owner field of tickets use a drop-down menu. Be sure to understand the performance implications before activating this option. See [TracTickets#Assign-toasDrop-DownList Assign-to as Drop-Down List]. Please note that e-mail addresses are '''not''' obfuscated in the resulting drop-down menu, so this option should not be used if e-mail addresses must remain protected.
fr: Force le champ propriétaire des tickets à utiliser une liste déroulante. Attention de bien comprendre l'impact sur les performances avant d'activer cette option. Voir [TracTickets#Assign-toasDrop-DownList Assigner-à comme liste déroulante]. Merci de noter que les adresses de courriel ne sont pas cachées dans le menu déroulant résultant, par conséquent cette option ne doit pas être utilisée si les adresses de courriels doivent rester protégées.

source: Default version for newly created tickets.
fr: Version par défaut pour les tickets nouvellement créés.

source: Default type for newly created tickets.
fr: Type par défaut pour les nouveaux tickets.

source: Default priority for newly created tickets.
fr: Priorité par défaut pour les tickets nouvellement créés.

source: Default milestone for newly created tickets.
fr: Jalon par défaut pour les tickets nouvellement créés.

source: Default component for newly created tickets.
fr: Composant par défaut pour les tickets nouvellement créés.

source: Default severity for newly created tickets.
fr: Sévérité par défaut pour les tickets nouvellement créés.

source: Default summary (title) for newly created tickets.
fr: Résumé (titre) par défaut pour les tickets nouvellement créés.

source: Default description for newly created tickets.
fr: Description par défaut pour les tickets nouvellement créés.

source: Default keywords for newly created tickets.
fr: Mots clés par défaut pour les tickets nouvellement créés.

source: Default owner for newly created tickets. The component owner is used when set to the value `< default >`.
fr: Propriétaire par défaut pour les nouveaux tickets. Le propriétaire du composant est utilisé si la valeur `< default >` est spécifiée.

source: Default cc: list for newly created tickets.
fr: Cc: liste par défaut pour les tickets nouvellement créés.

source: Default resolution for resolving (closing) tickets.
fr: Résolution par défaut pour résoudre (clore) les tickets.

source: Comma-separated list of `select` fields that can have an empty value. (//since 1.1.2//)
fr: Liste séparée par des virgules des champs qui peuvent rester vides. (//since 1.1.2//)

source: Maximum allowed comment size in characters.
fr: Nombre maximum de caractères du commentaire.

source: Maximum allowed description size in characters.
fr: Nombre maximum de caractères de la description.

source: Maximum allowed summary size in characters. (//since 1.0.2//)
fr: Nombre maximum de caractères du sommaire. (//since 1.0.2//)

source: The workflow for tickets is controlled by plugins. By default, there's only a `ConfigurableTicketWorkflow` component in charge. That component allows the workflow to be configured via this section in the `trac.ini` file. See TracWorkflow for more details.
fr: Le flux de travail pour les tickets est contrôlé par des plugins. Par défaut, il y a seulement un composant `ConfigurableTicketWorkflow` responsable. Ce composant permet au flux de travail d'être configuré via cette section dans le fichier `trac.ini`. Voir TracWorkflow pour plus de détails.

source: Width of ambiguous characters that should be used in the table of the notification mail. If `single`, the same width as characters in US-ASCII. This is expected by most users. If `double`, twice the width of US-ASCII characters. This is expected by CJK users.
fr: Largeur pour les caractères ambigus dans la table des courriels de notification. Cas général : `single` signifie la même largeur que les caractères en US-ASCII. `double`, deux fois la largeur que les carctères en US-ASCII. Convient pour les utilisateurs CJK (chinois, japonais, coréen).

source: Like `ticket_subject_template` but for batch modifications. (''since 1.0'')
fr: Identique à `ticket_subject_template` mais pour les modifications par lots. (''since 1.0'')

source: A Jinja2 text template snippet used to get the notification subject. The template variables are documented on the [TracNotification#Customizingthee-mailsubject TracNotification] page.
fr: Un fragment de modèle Jinja2 pour récupérer le sujet de la notification. Les variables du modèle sont documentés ici [TracNotification#Customizingthee-mailsubject TracNotification] page.

source: The default query for authenticated users. The query is either in [TracQuery#QueryLanguage query language] syntax, or a URL query string starting with `?` as used in `query:` [TracQuery#UsingTracLinks Trac links].
fr: La requête par défaut pour les utilisateurs authentifiés. Cette requête est soit une syntaxe [TracQuery#QueryLanguage Langage de requête Trac], soit une URL de requête commençant par `?` comme dans `query:` [TracQuery#UsingTracLinks Les liens Trac].

source: The default query for anonymous users. The query is either in [TracQuery#QueryLanguage query language] syntax, or a URL query string starting with `?` as used in `query:` [TracQuery#UsingTracLinks Trac links].
fr: La requête par défaut pour les utilisateurs anonymes. Cette requête est soit une syntaxe [TracQuery#QueryLanguage Langage de requête Trac], soit une URL de requête commençant par `?` comme dans `query:` [TracQuery#UsingTracLinks Les liens Trac].

source: Number of tickets displayed per page in ticket queries, by default. Set to `0` to specify no limit.
fr: Nombre de tickets par page affichés par défaut dans les requêtes sur les tickets. Mettre à zéro si pas de limite.

source: Number of tickets displayed per page in ticket reports, by default. Set to `0` to specify no limit.
fr: Nombre de tickets par page par défaut dans les rapports sur les tickets. Mettre à zéro si pas de limite.

source: Number of tickets displayed in the rss feeds for reports. Set to `0` to specify no limit.
fr: Nombre de tickets par défaut dans les flux RSS sur les tickets. Mettre à zéro si pas de limite.

source: As the workflow for tickets is now configurable, there can be many ticket states, and simply displaying closed tickets vs. all the others is maybe not appropriate in all cases. This section enables one to easily create ''groups'' of states that will be shown in different colors in the milestone progress bar. Note that the groups can only be based on the ticket //status//, nothing else. In particular, it's not possible to distinguish between different closed tickets based on the //resolution//. Example configuration with three groups, //closed//, //new// and //active// (the default only has closed and active): {{{ # the 'closed' group correspond to the 'closed' tickets closed = closed # .order: sequence number in the progress bar closed.order = 0 # .query_args: optional parameters for the corresponding # query. In this example, the changes from the # default are two additional columns ('created' and # 'modified'), and sorting is done on 'created'. closed.query_args = group=resolution,order=time,col=id,col=summary,col=owner,col=type,col=priority,col=component,col=severity,col=time,col=changetime # .overall_completion: indicates groups that count for overall # completion percentage closed.overall_completion = true new = new new.order = 1 new.css_class = new new.label = new # Note: one catch-all group for other statuses is allowed active = * active.order = 2 # .css_class: CSS class for this interval active.css_class = open # .label: displayed label for this group active.label = in progress }}} The definition consists in a comma-separated list of accepted status. Also, '*' means any status and could be used to associate all remaining states to one catch-all group. The CSS class can be one of: new (yellow), open (no color) or closed (green). Other styles can easily be added using custom CSS rule: `table.progress td.<class> { background: <color> }` to a [TracInterfaceCustomization#SiteAppearance site/style.css] file for example.
fr: Maintenant que le flux de travail des tickets est paramétrable, il peut y avoir de nombreux états pour un ticket, et simplement afficher les tickets clos vs. tous les autres peut ne pas être suffisant. Cette section vous permet de créer facilement des ''groupes'' d'états qui seront affichés avec différentes couleurs dans la barre de progression des jalons. Notez que les groupes peuvent seulement être constitués à partir de //status// du ticket, et rien d'autre. En particulier, il n'est pas possible de faire la différence entre les tickets clos en se basant sur la //resolution//. Exemple de configuration avec trois groupes, //closed//, //new// et //active// (par défaut il y a seulement closed et active) : {{{ # le groupe 'closed' correspond aux tickets 'clos' closed = closed # .order: indice de séquence dans la barre de progression closed.order = 0 # .query_args: paramètres optionnels dans la requête # correspondante. Dans cet exemple, la différence avec # le comportement par défaut est deux colonnes additionnelles # ('created' and 'modified'), et le tri est effectué sur 'created'. closed.query_args = group=resolution,order=time,col=id,col=summary,col=owner,col=type,col=priority,col=component,col=severity,col=time,col=changetime # .overall_completion: indique les groupes qui comptent pour # le pourcentage de réalisation totale. closed.overall_completion = true new = new new.order = 1 new.css_class = new new.label = new # Note: un groupe fourre-tout pour tous les autres états est autorisé active = * active.order = 2 # .css_class: classe CSS class pour cet intervalle active.css_class = open # .label: étiquette affichée pour ce groupe active.label = in progress }}} La définition consiste en une liste séparée par des virgules d'états acceptés. De plus, '*' signifie n'importe quel état et peut être utilisé pour associer les états restants avec un groupe fourre-tout. La classe CSS peut être : new (jaune), open (pas de couleur) ou closed (verte). D'autres styles peuvent être facilement ajoutés en utilisant des règles CSS personnalisées : `table.progress td.<class> { background: <color> }` dans un fichier [TracInterfaceCustomization#SiteAppearance site/style.css] par exemple.

source: Name of the component implementing `ITicketGroupStatsProvider`, which is used to collect statistics on groups of tickets for display in the roadmap views.
fr: Nom du composant implémentant `ITicketGroupStatsProvider`, qui est utilisé pour collecter des statistiques sur les groupes de tickets à afficher dans la vue de feuille de route.

source: Name of the component implementing `ITicketGroupStatsProvider`, which is used to collect statistics on groups of tickets for display in the milestone views.
fr: Nom du composant implémentant `ITicketGroupStatsProvider`, qui est utilisé pour collecter des statistiques sur les groupes de tickets à afficher dans la vue de jalons.

source: Default milestone to which tickets are retargeted when closing or deleting a milestone. (''since 1.1.2'')
fr: Jalon auquel les tickets sont rattachés lors de la clôture ou de la suppression de leur jalon. ('depuis 1.1.2'')

source: Default field to use for grouping tickets in the grouped progress bar. (''since 1.2'')
fr: Champ par défaut pour le groupage des tickets dans la barre de progression groupée. (''depuis 1.2'')

source: Enable the display of all ticket changes in the timeline, not only open / close operations.
fr: Activer l'affichage de tous les changements des tickets dans l'historique, pas seulement les opérations d'ouverture / fermeture

source: Enable the display of component of tickets in the timeline. (''since 1.1.1'')
fr: Permettre l'affichage des composants des tickets dans l'historique (''depuis 1.1.1'').

source: Which formatter flavor (e.g. 'html' or 'oneliner') should be used when presenting the description for new tickets. If 'oneliner', the [timeline] abbreviated_messages option applies.
fr: Quelle sorte de format (e.g. 'html' ou 'oneliner') doit être utilisé lors de la présentation de la description des nouveaux tickets. Si 'oneline', l'option [timeline] abbreviated_messages s'applique.

source: Whether Wiki formatter should respect the new lines present in the Wiki text. If set to 'default', this is equivalent to 'yes' for new environments but keeps the old behavior for upgraded environments (i.e. 'no').
fr: Spécifie si le format Wiki doit respecter les retours à la ligne présents dans le texte Wiki. Si positionné à 'défault', c'est l'équivalent de 'yes' pour les nouveaux environnements mais garde l'ancien comportement pour les environnements mis à jour (i.e. 'no').

source: The base query to be used when linkifying values of ticket fields. The query is a URL query string starting with `?` as used in `query:` [TracQuery#UsingTracLinks Trac links].
fr: La requête par défaut à utiliser lorsque l'on lie des valeurs des champs d'un ticket. Cette requête est une chaîne URL de requête commençant par `?` comme dans `query:` [TracQuery#UsingTracLinks Liens Trac].

source: Default number of days displayed in the Timeline, in days.
fr: Nombre de jours par défaut affichés dans l'Historique.

source: Maximum number of days (-1 for unlimited) displayable in the Timeline.
fr: Nombre de jours maximum (-1 pour illimité) affichable dans l'Historique.

source: Comma-separated list of allowed prefixes for repository directories when adding and editing repositories in the repository admin panel. If the list is empty, all repository directories are allowed.
fr: Liste séparée par des virgules de préfixes autorisés pour les répertoires de dépôts lors de l'ajout ou de l'édition de dépôts dans l'interface d'administration des dépôts. Si la liste est vide, tous les répertoires de dépôts sont autorisés.

source: One of the methods for registering repositories is to populate the `[repositories]` section of `trac.ini`. This is especially suited for setting up aliases, using a [TracIni#GlobalConfiguration shared configuration], or specifying repositories at the time of environment creation. See [TracRepositoryAdmin#ReposTracIni TracRepositoryAdmin] for details on the format of this section, and look elsewhere on the page for information on other repository providers.
fr: Une des alternatives pour enregistrer des nouveaux dépôts est de remplir la section `[repositories]` dans `trac.ini`. Cela convient particulièrement pour mettre en place des alias, pour utiliser une [TracIni#GlobalConfiguration Configuration partagée], ou pour spécifier des dépôts lors de la création de l'environnement. Voir [TracRepositoryAdmin#ReposTracIni TracRepositoryAdmin] pour les détails sur le format de cette section, voir ailleurs sur la page pour des informations sur d'autres fournisseurs de dépôts.

source: Default repository connector type. This is used as the default repository type for repositories defined in the [TracIni#repositories-section repositories] section or using the "Repositories" admin panel.
fr: Type de connecteur aux dépôts par défaut. Est utilisé en tant que type de dépôt par défaut pour les dépôts définis dans la section [TracIni#repositories-section repositories] ou bien pour l'interface d'administration des dépôts.

source: The path to the Subversion [%(svnbook)s authorization (authz) file]. To enable authz permission checking, the `AuthzSourcePolicy` permission policy must be added to `[trac] permission_policies`. Non-absolute paths are relative to the Environment `conf` directory.
fr: Le chemin vers [%(svnbook)s authorization (authz) file] de Subversion. Pour activer la vérification des permissions authz, la politique de permission `AuthzSourcePolicy` doit être ajoutée à `[trac] permission_policies`. Les chemins non absolus sont relatifs au répertoire d'environment `conf`.
