Repository: pypi-data/pypi-mirror-231
Catalog: packages/Trac/Trac-1.6.tar.gz/Trac-1.6/trac/locale/*/LC_MESSAGES/tracini.po
Languages: fr

source: List of URIs considered "safe cross-origin", that will be rendered as `img` element without `crossorigin="anonymous"` attribute or used in `url()` of inline style attribute even if `[wiki] render_unsafe_content` is `false` (''since 1.0.15''). To make any origins safe, specify "*" in the list.
fr: Liste des URIs considérés comme sûrs inter-domaine (safe cross-origin), qui seront affichées comme un élément `img` sans l'attribut `crossorigin="anonymous"` ou dans une `url()` de style incorporée même si `[wiki] render_unsafe_content` est `false` (''depuis 1.0.15''). Pour rendre toutes les origines sûres, spécifier "*" dans la liste.

source: This section configures InterTrac prefixes. Option names in this section that contain a `.` are of the format `<name>.<attribute>`. Option names that don't contain a `.` define an alias. The `.url` attribute is mandatory and is used for locating the other Trac. This can be a relative path when the other Trac environment is located on the same server. The `.title` attribute is used for generating a tooltip when the cursor is hovered over an InterTrac link. Example configuration: {{{#!ini [intertrac] # -- Example of setting up an alias: t = trac # -- Link to an external Trac: genshi.title = Edgewall's Trac for Genshi genshi.url = https://genshi.edgewall.org }}}
fr: Cette section configure les préfixes InterTrac. Les options dont le nom contient un "." sont du format `<name>.<attribute>` . Les options qui ne contiennent pas de "." définissent un alias. L'attribut ".url" est obligatoire et sert à localiser l'autre Trac. Il peut s'agir d'un chemin relatif si l'autre environnement Trac est placée sur le même serveur. L'attribut ".title" sert à générer un info-bulle lorsque le curseur passe sur le lien. Exemple de configuration : {{{#!ini [intertrac] # -- Configuration d'un alias : t = trac # -- Lien vers une Trac externe : genshi.title = Edgewall's Trac for Genshi genshi.url = https://genshi.edgewall.org }}}

source: Every option in the `[interwiki]` section defines one InterWiki prefix. The option name defines the prefix. The option value defines the URL, optionally followed by a description separated from the URL by whitespace. Parametric URLs are supported as well. '''Example:''' {{{ [interwiki] MeatBall = http://www.usemod.com/cgi-bin/mb.pl? PEP = http://www.python.org/peps/pep-$1.html Python Enhancement Proposal $1 tsvn = tsvn: Interact with TortoiseSvn }}}
fr: Chaque option dans la section `[interwiki]` définit un préfixe InterWiki. Le nom de l'option définit le préfixe. La valeur de l'option définit l'URL, optionnellement suivie par une description séparée de l'URL par une espace. Les URLs paramétriques sont aussi acceptés. '''Exemple :''' {{{ [interwiki] MeatBall = http://www.usemod.com/cgi-bin/mb.pl? PEP = http://www.python.org/peps/pep-$1.html Python Enhancement Proposal $1 tsvn = tsvn: Interact with TortoiseSvn }}}

source: Maximum allowed wiki page size in characters.
fr: Nombre maximum de caractères de la page wiki.

source: Default height of the textarea on the wiki edit page. (//Since 1.1.5//)
fr: Hauteur par défaut de la zone de texte en modification de la page wiki. (//Since 1.1.5//)
