Repository: pypi-data/pypi-mirror-231
Catalog: packages/Trac/Trac-1.6.tar.gz/Trac-1.6/trac/locale/*/LC_MESSAGES/tracini.po
Languages: fr

source: The module prefix used in the `authz_file` for the default repository. If left empty, the global section is used.
fr: Le préfixe de module utilisé dans `authz_file` pour le dépôt par défaut. Si laissé vide, la section globale est utilisée.

source: Comma-separated list of version control properties to render as wiki content in the repository browser.
fr: Liste séparée par des virgules de propriétés de gestion de versions à présenter en tant que contenu wiki dans le navigateur de dépôts.

source: Comma-separated list of version control properties to render as oneliner wiki content in the repository browser.
fr: Liste séparée par des virgules de propriétés de gestion de versions à présenter en tant que contenu wiki "oneliner" dans le navigateur de dépôts.

source: List of repository paths that can be downloaded. Leave this option empty if you want to disable all downloads, otherwise set it to a comma-separated list of authorized paths (those paths are glob patterns, i.e. "*" can be used as a wild card). In a multi-repository environment, the path must be qualified with the repository name if the path does not point to the default repository (e.g. /reponame/trunk). Note that a simple prefix matching is performed on the paths, so aliases won't get automatically resolved.
fr: Liste des chemins de dépôts qui peuvent être téléchargés. Laisser cette option vide pour désactiver tous les téléchargements, dans la cas contraire positionner la valeur à une liste séparée par des virgules de chemins autorisés (ces chemins sont des motifs glob, par exemple "*" peut être utilisé comme joker). Dans un environnement multi-dépôt, le chemin doit être qualifié avec le nom du dépôt si le chemin ne pointe pas vers le dépôt par défaut (e.g. /reponame/trunk). Notez qu'une simple correspondance sur le préfixe est réalisé sur les chemins, donc les alias ne seront pas automatiquement résolus.

source: Enable colorization of the ''age'' column. This uses the same color scale as the source code annotation: blue is older, red is newer.
fr: Active la coloration pour la colonne "age". Utilise la même palette de couleurs que l'annotation du code source : bleu pour le plus ancien, rouge pour le plus récent.

source: (r,g,b) color triple to use for the color corresponding to the newest color, for the color scale used in ''blame'' or the browser ''age'' column if `color_scale` is enabled.
fr: Triplet de couleur (r,v,b) à utiliser pour la couleur du plus récent, valable pour la palette de couleurs utilisé dans "blame" ou dans la colonne "age" du navigateur si `color_scale` est activé.

source: (r,g,b) color triple to use for the color corresponding to the oldest color, for the color scale used in ''blame'' or the browser ''age'' column if `color_scale` is enabled.
fr: Triplet de couleur (r,v,b) à utiliser pour la couleur du plus ancien, valable pour la palette de couleurs utilisée dans "blame" ou dans la colonne "age" du navigateur si `color_scale` est activé.

source: If set to a value between 0 and 1 (exclusive), this will be the point chosen to set the `intermediate_color` for interpolating the color value.
fr: Pour une valeur entre 0 et 1 (1 non inclus), définit le point de couleur intermédiaire pour l'interpolation de la valeur de la couleur.

source: (r,g,b) color triple to use for the color corresponding to the intermediate color, if two linear interpolations are used for the color scale (see `intermediate_point`). If not set, the intermediate color between `oldest_color` and `newest_color` will be used.
fr: Triplet de couleur (r,v,b) à utiliser pour la couleur correspondante à la couleur intermédiaire, si deux interpolations linéaires sont utilisées pour cette échelle de couleur (voir `intermediate_point`). Si non activé, la couleur intermédiaire entre oldest_color` et `newest_color` sera utilisée.

source: Whether raw files should be rendered in the browser, or only made downloadable. Pretty much any file may be interpreted as HTML by the browser, which allows a malicious user to create a file containing cross-site scripting attacks. For open repositories where anyone can check-in a file, it is recommended to leave this option disabled.
fr: Définit si les fichiers bruts sont affichés dans le navigateur ou seulement téléchargeables. Quasiment tous les fichiers peuvent être interprétés comme du HTML par le navigateur, ce qui pourrait permettre à un utilisateur mal intentionné d'attacher un fichier contenant un attaque "cross-site scripting". Pour les sites publics où les utilisateurs anonymes peuvent créer des pièces jointes, il est recommandé de laisser cette option désactivée.

source: Comma-separated list of version control properties to hide from the repository browser.
fr: Liste séparée par des virgules de propriétés de gestion de versions à cacher dans le navigateur de dépôts.

source: Number of files to show (`-1` for unlimited, `0` to disable). This can also be `location`, for showing the common prefix for the changed files.
fr: Nombre de fichiers à afficher (`-1` pour illimité, `0` pour désactiver). Cela peut aussi être `location`, pour montrer le préfixe commun pour les fichiers modifiés.

source: Whether wiki-formatted changeset messages should be multiline or not. If this option is not specified or is false and `wiki_format_messages` is set to true, changeset messages will be single line only, losing some formatting (bullet points, etc).
fr: Si les messages de révision au format wiki doivent être multi-lignes ou pas. Si cette option n'est pas spécifiée ou est à la valeur fausse et `wiki_format_messages` est positionné à vrai, les messages de révision seront seulement sur une seule ligne, et perdront peut-être un peu de leur mise en page (liste à puces, etc.).

source: Whether consecutive changesets from the same author having exactly the same message should be presented as one event. That event will link to the range of changesets in the log view.
fr: Définir si des révisions consécutives du même auteur avec le même message doivent être présentées comme un seul événement. Cet événement sera lié au groupe de révisions dans le vue journal.

source: Maximum number of modified files for which the changeset view will attempt to show the diffs inlined.
fr: Nombre maximum de fichier modifiés pour lequel la vue de la révision tente d'afficher les différences en ligne.

source: Maximum total size in bytes of the modified files (their old size plus their new size) for which the changeset view will attempt to show the diffs inlined.
fr: Taille maximum en octets des fichiers modifiés (leur taille précédente plus leur taille actuelle) pour laquelle le vue des révisions tente d'afficher les différences en ligne.

source: Whether wiki formatting should be applied to changeset messages. If this option is disabled, changeset messages will be rendered as pre-formatted text.
fr: Si le formatage wiki doit être appliqué aux messages de révision. Si cette option est désactivée, les messages de révision seront présentés comme du texte pré-formatté.

source: Default value for the limit argument in the TracRevisionLog.
fr: Valeur par défaut pour l'argument limite dans le ''TracRevisionLog''.

source: Comma-separated list of colors to use for the TracRevisionLog graph display. (''since 1.0'')
fr: Liste séparée par des virgules de couleurs à utiliser pour l'affichage du graphe TracRevisionLog. (''depuis 1.0'')

source: Whether the IP address of the user should be checked for authentication.
fr: Spécifier si l'adresse IP de l'utilisateur doit être vérfiée pour l'authentification.

source: Whether login names should be converted to lower case.
fr: Spécifier si les noms de connection doivent être convertis en minuscules.

source: Auth cookie domain attribute. The auth cookie can be shared among multiple subdomains by setting the value to the domain. (//since 1.2//)
fr: Attribut ''domain'' du cookie d'authentification Le cookie auth peut être partagé entre de pultiples sous-domaines en indiquant le nom du domaine. (//since 1.2//)

source: Lifetime of the authentication cookie, in seconds. This value determines how long the browser will cache authentication information, and therefore, after how much inactivity a user will have to log in again. The value of 0 makes the cookie expire at the end of the browsing session.
fr: Durée de vie en secondes du cookie d'authentification. Cette valeur indique combien de temps le navigateur conserve les informations d'authentification, et après quelle durée d'inactivité l'utilisateur devra s'authentifier à nouveau. La valeur 0 fait expirer le cookie à la fin de la session de navigation.

source: Path for the authentication cookie. Set this to the common base path of several Trac instances if you want them to share the cookie.
fr: Chemin du cookie d'authentification. Indiquez la partie commune du chemin des différentes instances de Trac qui doivent partager le même cookie.

source: Path to the //shared templates directory//. Templates in that directory are loaded in addition to those in the environments `templates` directory, but the latter take precedence. Non-absolute paths are relative to the Environment `conf` directory.
fr: Chemin vers ''le répertoire des modèles partagés''. Les modèles dans ce répertoire sont chargés en complément de ceux dans le dossier "modèles" de l'environnement, mais ces derniers sont prioritaires. Des chemins non absolus sont relatifs au dossier "conf" de l'environnement.

source: Path to the //shared htdocs directory//. Static resources in that directory are mapped to /chrome/shared under the environment URL, in addition to common and site locations. This can be useful in site.html for common interface customization of multiple Trac environments. Non-absolute paths are relative to the Environment `conf` directory. (''since 1.0'')
fr: Chemin vers //shared htdocs directory//. Les ressources statiques dans ce répertoire correpondent à /chrome/shared dans l'URL de l'environnement, en plus des répertoires common et site locations. Cela peut être utile dans site.html pour la personnalisation des interfaces communes de plusieurs environnements Trac. Des chemins non absolus sont relatifs au dossier "conf" de l'environnement. (''since 1.0'')

source: Automatically reload template files after modification.
fr: Rechargement automatique des fichiers de template après modification.

source: Base URL for serving the core static resources below `/chrome/common/`. It can be left empty, and Trac will simply serve those resources itself. Advanced users can use this together with [TracAdmin trac-admin ... deploy <deploydir>] to allow serving the static resources for Trac directly from the web server. Note however that this only applies to the `<deploydir>/htdocs/common` directory, the other deployed resources (i.e. those from plugins) will not be made available this way and additional rewrite rules will be needed in the web server.
fr: URL de base pour servir les ressources statiques de base situées sous `/chrome/common/`. Il peut être laissé vide, et Trac servira simplement ces ressources lui-même. Les utilisateurs avancés peuvent utiliser cela en même temps que [TracAdmin trac-admin ... deploy <deploydir>] pour permettre de servir les ressources statiques pour Trac directement à partir d'un serveur web. Notez cependant que cela s'applique seulement au répertoire `<deploydir>/htdocs/common`, les autres ressources déployées (i.e. celles provenant des plugins) ne seront pas accessibles de cette manière et des règles de réécriture additionnelles seront nécessaires dans le serveur web.

source: Location of the jQuery !JavaScript library (version %(version)s). An empty value loads jQuery from the copy bundled with Trac. Alternatively, jQuery could be loaded from a CDN, for example: http://code.jquery.com/jquery-%(version)s.min.js, http://ajax.aspnetcdn.com/ajax/jQuery/jquery-%(version)s.min.js or https://ajax.googleapis.com/ajax/libs/jquery/%(version)s/jquery.min.js. (''since 1.0'')
fr: Emplacement de la bibliothèque !JavaScript jQuery (version %(version)s). Une valeur vide charge jQuery à partir de la copie embarquée avec Trac. Autrement, jQuery peut être téléchargé à partir d'un CDN, par exemple : http://code.jquery.com/jquery-%(version)s.min.js ou http://ajax.aspnetcdn.com/ajax/jQuery/jquery-%(version)s.min.js ou https://ajax.googleapis.com/ajax/libs/jquery/%(version)s/jquery.min.js. (''depuis 1.0'')

source: Location of the jQuery UI !JavaScript library (version %(version)s). An empty value loads jQuery UI from the copy bundled with Trac. Alternatively, jQuery UI could be loaded from a CDN, for example: https://ajax.googleapis.com/ajax/libs/jqueryui/%(version)s/jquery-ui.min.js or http://ajax.aspnetcdn.com/ajax/jquery.ui/%(version)s/jquery-ui.min.js. (''since 1.0'')
fr: Emplacement de la bibliothèque !JavaScript jQuery UI (version %(version)s). Une valeur vide charge jQuery UI à partir de la copie embarquée avec Trac. Autrement, jQuery UI peut être téléchargé à partir d'un CDN, par exemple : https://ajax.googleapis.com/ajax/libs/jqueryui/%(version)s/jquery-ui.min.js ou http://ajax.aspnetcdn.com/ajax/jquery.ui/%(version)s/jquery-ui.min.js (''depuis 1.0'')

source: Location of the theme to be used with the jQuery UI !JavaScript library (version %(version)s). An empty value loads the custom Trac jQuery UI theme from the copy bundled with Trac. Alternatively, a jQuery UI theme could be loaded from a CDN, for example: https://ajax.googleapis.com/ajax/libs/jqueryui/%(version)s/themes/start/jquery-ui.css or http://ajax.aspnetcdn.com/ajax/jquery.ui/%(version)s/themes/start/jquery-ui.css. (''since 1.0'')
fr: Emplacement du thème à utiliser avec la bibliothèque !JavaScript jQuery UI (version %(version)s). Une valeur vide charge le thème personnalisé jQuery UI à partir de la copie embarquée avec Trac. Un thème jQuery UI peut être téléchargé à partir d'un CDN, par exemple: https://ajax.googleapis.com/ajax/libs/jqueryui/%(version)s/themes/start/jquery-ui.css ou http://ajax.aspnetcdn.com/ajax/jquery.ui/%(version)s/themes/start/jquery-ui.css. (''depuis 1.0'')

source: Configures the main navigation bar, which by default contains //Wiki//, //Timeline//, //Roadmap//, //Browse Source//, //View Tickets//, //New Ticket//, //Search// and //Admin//. The `label`, `href`, and `order` attributes can be specified. Entries can be disabled by setting the value of the navigation item to `disabled`. The following example renames the link to WikiStart to //Home//, links the //View Tickets// entry to a specific report and disables the //Search// entry. {{{#!ini [mainnav] wiki.label = Home tickets.href = /report/24 search = disabled }}} See TracNavigation for more details.
fr: Configure la barre de navigation principale, qui contient par défaut //Wiki//, //Timeline//, //Roadmap//, //Browse Source//, //View Tickets//, //New Ticket//, //Search// and //Admin//. Les attributs `label`, `href`, et `order` peuvent être spécifiés. Des options peuvent être désactivées en plaçant leur valeur à désactivé. L'exemple suivant renommer le lien WikiStart vers //Home//, connecte l'entrée //View Tickets// à un rapport spécifique et désactive l'entrée //Search//. {{{#!ini [mainnav] wiki.label = Home tickets.href = /report/24 search = disabled }}} See TracNavigation for more details.

source: Configures the meta navigation entries, which by default are //Login//, //Logout//, //Preferences//, ''!Help/Guide'' and //About Trac//. The allowed attributes are the same as for `[mainnav]`. Additionally, a special entry is supported - `logout.redirect` is the page the user sees after hitting the logout button. For example: {{{#!ini [metanav] logout.redirect = wiki/Logout }}} See TracNavigation for more details.
fr: Configuration la barre de menus sous "Recherche". Définit les entrées qui sont par défaut //Login//, //Logout//, //Preferences//, ''!Help/Guide'' and //About Trac//. Les attributs sont les mêmes que pour `[mainnav]`. Une option spéciale est prévue `logout.redirect` qui spécifie la page à afficher après la déconnexion. Par exemple : {{{#!ini [metanav] logout.redirect = wiki/Logout }}} Voir TracNavigation pour plus de détails.

source: URL to link to, from the header logo.
fr: URL à relier, à partir du logo d'en-tête.

source: URL of the image to use as header logo. It can be absolute, server relative or relative. If relative, it is relative to one of the `/chrome` locations: `site/your-logo.png` if `your-logo.png` is located in the `htdocs` folder within your TracEnvironment; `common/your-logo.png` if `your-logo.png` is located in the folder mapped to the [#trac-section htdocs_location] URL. Only specifying `your-logo.png` is equivalent to the latter.
fr: URL de l'image à utiliser comme logo d'en-tête. Elle peut être absolue, relative au serveur ou bien relative. Si relative, elle est relative par rapport à un des emplacements `/chrome` : `site/your-logo.png` si `your-logo.png` est situé dans le répertoire `htdocs` de votre TracEnvironment ; `common/your-logo.png` si `your-logo.png` est situé dans le dossier correspondant à l'URL [#trac-section htdocs_location]. Spécifier seulement `your-logo.png` est équivalent à ce dernier cas.

source: Alternative text for the header logo.
fr: Texte alternatif pour le logo d'en-tête.

source: Width of the header logo image in pixels.
fr: Largeur de l'image du logo d'en-tête en pixels.

source: Height of the header logo image in pixels.
fr: Hauteur de l'image du logo d'en-tête en pixels.

source: Show email addresses instead of usernames. If false, email addresses are obfuscated for users that don't have EMAIL_VIEW permission.
fr: Montrer les adresses de courriel au lieu des noms d'utilisateur. Si faux, les adresses de courriel sont cachées aux utilisateurs ne disposant pas de la permission EMAIL_VIEW.

source: Show full names instead of usernames. (//since 1.2//)
fr: Montrer les noms complets au lieu des noms d'utilisateurs. (//depuis 1.2//)

source: Never obfuscate `mailto:` links explicitly written in the wiki, even if `show_email_addresses` is false or the user doesn't have EMAIL_VIEW permission.
fr: Ne jamais masquer les liens `mailto:` explicitement écrits dans le wiki, même si `show_email_addresses` a la valeur fausse ou si l'utilisateur a la permission EMAIL_VIEW.

source: Make `<textarea>` fields resizable. Requires !JavaScript.
fr: Rendre les champs `<textarea>` redimensionnables. Nécessite !JavaScript.

source: Add a simple toolbar on top of Wiki <textarea>s. (''since 1.0.2'')
fr: Ajout d'une barre d'outils simple en haut du Wiki <textarea>s. (''since 1.0.2'')

source: Inactivity timeout in seconds after which the automatic wiki preview triggers an update. This option can contain floating-point values. The lower the setting, the more requests will be made to the server. Set this to 0 to disable automatic preview.
fr: Période d'inactivité en secondes avant que la prévisualisation automatique du wiki déclenche une mise à jour. Cette option peut contenir des nombres en virgule flottante. Plus la valeur est faible, plus il y aura de requêtes envoyées au serveur. Positionner cette valeur à 0 pour désactiver la pré-visualisation automatique.

source: The date information format. Valid options are 'relative' for displaying relative format and 'absolute' for displaying absolute format. (''since 1.0'')
fr: Le format d'information de date. Les options valides sont 'relative' pour afficher un format relative et 'absolute' pour afficher un format absolus. (''depuis 1.0'')

source: If enabled, send contents as chunked encoding in HTTP/1.1. Otherwise, send contents with `Content-Length` header after entire of the contents are rendered. (''since 1.0.6'')
fr: Pour activer l'encodage de transfert en bloc du protocole HTTP/1.1. Sinon, envoie le contenu avec l'entête `Content-Length` après le rendu complet du contenu. ("depuis 1.0.6")

source: Ordered list of filters to apply to all requests.
fr: Liste ordonnée de filtres à appliquer à toutes les requêtes.

source: Name of the component that handles requests to the base URL. Options include `TimelineModule`, `RoadmapModule`, `BrowserModule`, `QueryModule`, `ReportModule`, `TicketModule` and `WikiModule`. The [/prefs/userinterface session preference] for default handler take precedence, when set.
fr: Nom du composant qui gère les requêtes vers l'URL de base. Les options possibles sont `TimelineModule`, `RoadmapModule`, `BrowserModule`, `QueryModule`, `ReportModule`, `TicketModule` et `WikiModule`. Si [/prefs/userinterface session preference] pour le gestionnaire par défaut est défini, alors il remplace ces options.

source: The default timezone to use
fr: Le fuseau horaire par défaut à utiliser

source: The preferred language to use if no user preference has been set.
fr: La langue par défaut si l'utilisateur n'a pas enregistré de préférence.

source: The date format. Valid options are 'iso8601' for selecting ISO 8601 format, or leave it empty which means the default date format will be inferred from the browser's default language. (''since 1.0'')
fr: Le format de date. Les options valides sont 'iso8601' pour sélectionner le format ISO 8601, ou bien laisser vider pour signifier le format de date par défaut qui sera déduit du language par défaut du navigateur. (''depuis 1.0'')

source: When true, send a `X-Sendfile` header and no content when sending files from the filesystem, so that the web server handles the content. This requires a web server that knows how to handle such a header, like Apache with `mod_xsendfile` or lighttpd. (''since 1.0'')
fr: Si vrai, envoie un en-tête `X-Sendfile` et pas de contenu lors de l'envoi de fichiers à partir du système de fichiers, de telle façon que le serveur web s'occupe du contenu. Cela requiert un serveur web qui sait comment s'occuper d'un en-tête tel que celui là, comme Apache avec mod_xsendfile` ou lighttpd. (''depuis 1.0'')

source: The header to use if `use_xsendfile` is enabled. If Nginx is used, set `X-Accel-Redirect`. (''since 1.0.6'')
fr: Entête à utiliser si `use_xsendfile` est activé. Avec Nginx, set `X-Accel-Redirect`. (''depuis 1.0.6'')

source: Headers to be added to the HTTP request. (''since 1.2.3'') The header name must conform to [https://tools.ietf.org/html/rfc7230 RFC7230] and the following reserved names are not allowed: content-type, content-length, location, etag, pragma, cache-control, expires.
fr: Entêtes à ajouter à la requête HTTP. ('depuis 1.2.3'') Le nom de l'entête doit être conforme à la [https://tools.ietf.org/html/rfc7230 RFC7230] et les noms réservés suivants ne sont pas autorisés : content-type, content-length, location, etag, pragma, cache-control, expires.

source: Enable/disable highlighting CamelCase links to missing pages.
fr: Activer/désactiver la mise en évidence des liens CamelCase vers des pages manquantes.

source: Enable/disable splitting the WikiPageNames with space characters.
fr: Activer/désactiver le découpage des noms des pages du wiki avec des espaces.

source: Enable/disable the use of unsafe HTML tags such as `<script>` or `<embed>` with the HTML [wiki:WikiProcessors WikiProcessor]. For public sites where anonymous users can edit the wiki it is recommended to leave this option disabled.
fr: Activer/désactiver l'utilisation de balises HTML non sûres comme `<script>` ou `<embed>` avec le [wiki:WikiProcessors WikiProcessor] HTML Pour les sites publics où les utilisateurs anonymes peuvent éditer le wiki, il est recommandé de laisser cette option désactivée.

source: List of URI schemes considered "safe", that will be rendered as external links even if `[wiki] render_unsafe_content` is `false`.
fr: Liste de schémas URI considérés comme sûrs, qui seront représentés comme des liens externes même si `[wiki] render_unsafe_content` est égal à `false`.
