#!/bin/bash

# Генерация документация по степ функциям behave'а.
# =================================================
# Для генерации док. необходимо что-бы было установлено приложение, behave и
# активировано виртуальное окружение приложения.
# В качестве первого параметра передается полный путь к директории в которой находятся селениум тесты


if [[ $1 ]]
then
  behave --lang ru $1 --dry-run --format sphinx.steps > ./step_doc.rst
  python split_behave_doc.py --step-doc step_doc.rst
  rm step_doc.rst
else
  echo "Необходимо указать путь к директории в которой находятся селениум тесты."
fi

